app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
---
    public function allData()
    {
        return $this->db->table('tbl_user')->get()->getResultArray();

INSERT INTO `tbl_user` (`nama_user`, `username`, `password`, `level`) VALUES ('1', '2', '6216f8a75fd5bb3d5f22b6f9958cdede3fc086c2', '2')
---
    public function insertData($data)
    {
        $this->db->table('tbl_user')->insert($data);

DELETE FROM `tbl_user`
WHERE `id_user` = '6'
AND `id_user` = '6'
---
    public function deleteData($data)
    {
        $this->db->table('tbl_user')->where('id_user', $data['id_user'])->delete($data);